<?php

namespace Database\Seeders;

use App\Models\Brand;
use Illuminate\Database\Seeder;

class BrandSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */

    public function run(): void
    {
        $brandNames = [
            "هلو فرش",
            "ترک ویر",
            "دو میم",
            "فوردو",
            "فورلایف",
            "چارپایه",
            "سون الون",
            "سون پون",
            "سون کوئین",
            "سون هون",
            "ای دیتا",
            "آ اند اس",
            "ابرکرومبی اند فیچ",
            "ایسر",
            "آکوا دی پارما",
            "آدمک",
            "آدیداس",
            "آدولفو",
            "آدور",
            "ادورا",
            "آرمان فردا",
            "اگنر",
            "ایر وال",
            "اجمل",
            "آکو گیم",
            "آلن دلون",
            "آلاوه",
            "آلکمیستو",
            "آلدو",
            "آلفا مونته",
            "آلفونسی",
            "آلفرد دانهیل",
            "ال وایت",
            "الون",
            "آلفا بتا",
            "آلتین باشاک",
            "الویز",
            "امیزفیت",
            "امریکن توریستر",
            "آمیچی",
            "امرداد",
            "آمواژ",
            "آناندا",
            "آندیا",
            "آنجل شلیسر",
            "آنیکا",
            "انکر",
            "آنتروس",
            "آنتونیو باندراس",
            "آنتونیو روسینی",
            "آوکینگ",
            "اپیسر",
            "اپل",
            "آکوا دی پولو",
            "آرامیس",
            "ارس",
            "آرکانوم",
            "آردن اکسپرتیج",
            "آردن",
            "آردن اتوپیا",
            "آردن سی فکتور",
            "آردن پیگمنتا",
            "آردن سبوما",
            "آردن سولاریس",
            "آر یو اکی",
            "آرکو من",
            "آرماف",
        ];
        foreach ($brandNames as $brandName) {
            Brand::create([
                'name' => $brandName,
            ]);
        }
    }
}
